research/artifacts/proof-audit-round7-20260921/software-review-v2/independent-review-20260921-v2/filter-only-mutation.diff
--- frozen/regression/provenance.py
+++ MUTANT/regression/provenance.py
@@ -54,7 +54,7 @@
     # Deliberately no Base/path allowlist filter at observation time.
     return {name: str(Path(module.__file__).resolve())
             for name, module in list(sys.modules.items())
-            if getattr(module, '__file__', None)}
+            if getattr(module, '__file__', None) and Path(module.__file__).resolve().is_relative_to(Path(__file__).resolve().parents[1])}
 
 
 def expected_bindings(tree, kind):
